# Notebook Setup

The following two commands are for the instructor's teacher notebook.  If you are following along using MySQL Workbench, you will just need to open the Workbench and connect to your server. You won't need to enter these commands.

In [175]:
load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [176]:
%%sql 
mysql+pymysql://instructor:password@localhost/

'Connected: instructor@'

# Database Setup

## Database Creation

First we will create a database named chapter3insert.  To make it easier to re-run these commands, we are going to drop the database if it already exists.

In the future, if you are working with an existing database, you may choose to just add the `use` statement.  However, you must remember that you can't re-create a table that already exists.

In [177]:
%%sql
drop database if exists chapter3insert;
create database chapter3insert;
use chapter3insert;

 * mysql+pymysql://instructor:***@localhost/
0 rows affected.
1 rows affected.
0 rows affected.

[]

# Schema Definition

Next, we will four tables for our database.  Do you understand each part of the schema?

In [178]:
%%sql
create table course (
    course_id		varchar(8), 
	 title			varchar(50), 
	 dept_name		varchar(20),
	 credits		numeric(2,0)
);

 * mysql+pymysql://instructor:***@localhost/
0 rows affected.

[]

In [179]:
%%sql
create table instructor(
    ID			varchar(5), 
	 name			varchar(20) not null, 
	 dept_name		varchar(20), 
	 salary			numeric(8,2),
	 primary key (ID)
    );

 * mysql+pymysql://instructor:***@localhost/
0 rows affected.

[]

In [180]:
%%sql
create table student
	(ID			varchar(5), 
	 name			varchar(20) not null, 
	 dept_name		varchar(20), 
	 tot_cred		numeric(3,0) check (tot_cred >= 0),
	 primary key (ID)
	);

 * mysql+pymysql://instructor:***@localhost/
0 rows affected.

[]

In [181]:
%%sql
create table department
	(dept_name		varchar(20), 
	 building		varchar(15), 
	 budget		        numeric(12,2) check (budget > 0),
	 primary key (dept_name)
	);

 * mysql+pymysql://instructor:***@localhost/
0 rows affected.

[]

# Check our work.

Now let's examine what we created.  In WorkBench, just refresh the list of tables.

In [182]:
%%sql 
show tables;

 * mysql+pymysql://instructor:***@localhost/
4 rows affected.

[('course',), ('department',), ('instructor',), ('student',)]

# Insertion

When we want to add tuples to a table, we use the `insert` command.  

The format is like this:

`insert into <table>`
values (A~1~, A~2~, A~3~, A~4~)

In [183]:
%%sql 
insert into course       
values ('CS-437', 'Database Systems', 'Comp. Sci.', 4);

 * mysql+pymysql://instructor:***@localhost/
1 rows affected.

[]

In [184]:
%%sql 
select * from course;

 * mysql+pymysql://instructor:***@localhost/
1 rows affected.

[('CS-437', 'Database Systems', 'Comp. Sci.', Decimal('4'))]

In [185]:
%%sql 
insert into course (course_id, title, dept_name, credits)            
values ('CS-437', 'Database Systems', 'Comp. Sci.', 4);

 * mysql+pymysql://instructor:***@localhost/
1 rows affected.

[]

In [187]:
%%sql 
insert into course (course_id, title, dept_name)            
values ('CS-437', 'Database Systems', 'Comp. Sci.');

 * mysql+pymysql://instructor:***@localhost/
1 rows affected.

[]

In [189]:
%%sql 
insert into course (title, course_id, dept_name)            
values ('Database Systems', 'CS-437', 'Comp. Sci.');

 * mysql+pymysql://instructor:***@localhost/
1 rows affected.

[]

In [194]:
%%sql
create table budget
(
    id varchar(2)
);

 * mysql+pymysql://instructor:***@localhost/
0 rows affected.

[]

In [196]:
%%sql 
insert into budget 
values (1, 'Comp. Sci.', 10000, 123);

 * mysql+pymysql://instructor:***@localhost/

InternalError: (pymysql.err.InternalError) (1136, "Column count doesn't match value count at row 1")
[SQL: insert into budget
values (1, 'Comp. Sci.', 10000, 123);]
(Background on this error at: http://sqlalche.me/e/2j85)

In [197]:
%%sql 
select * from course;

 * mysql+pymysql://instructor:***@localhost/
4 rows affected.

[('CS-437', 'Database Systems', 'Comp. Sci.', Decimal('4')),
 ('CS-437', 'Database Systems', 'Comp. Sci.', Decimal('4')),
 ('CS-437', 'Database Systems', 'Comp. Sci.', None),
 ('CS-437', 'Database Systems', 'Comp. Sci.', None)]

In [198]:
%%sql
insert into student
values ('3003', 'Green', 'Finance', null);

 * mysql+pymysql://instructor:***@localhost/
1 rows affected.

[]

In [199]:
%%sql
select * from student;

 * mysql+pymysql://instructor:***@localhost/
1 rows affected.

[('3003', 'Green', 'Finance', None)]

## Data Creation

Now that we know how insert works, let's add more sample data to our relations.

In [200]:
%%sql 
insert into instructor values ('10101', 'Srinivasan', 'Comp. Sci.', '65000');
insert into instructor values ('12121', 'Wu', 'Finance', '90000');
insert into instructor values ('15151', 'Mozart', 'Music', '40000');
insert into instructor values ('22222', 'Einstein', 'Physics', '95000');
insert into instructor values ('32343', 'El Said', 'History', '60000');
insert into instructor values ('33456', 'Gold', 'Physics', '87000');
insert into instructor values ('45565', 'Katz', 'Comp. Sci.', '75000');
insert into instructor values ('58583', 'Califieri', 'History', '62000');
insert into instructor values ('76543', 'Singh', 'Finance', '80000');
insert into instructor values ('76766', 'Crick', 'Biology', '72000');
insert into instructor values ('83821', 'Brandt', 'Comp. Sci.', '92000');
insert into instructor values ('98345', 'Kim', 'Elec. Eng.', '80000');
insert into department values ('Biology', 'Watson', '90000');
insert into department values ('Comp. Sci.', 'Taylor', '100000');
insert into department values ('Elec. Eng.', 'Taylor', '85000');
insert into department values ('Finance', 'Painter', '120000');
insert into department values ('History', 'Painter', '50000');
insert into department values ('Music', 'Packard', '80000');
insert into department values ('Physics', 'Watson', '70000');

 * mysql+pymysql://instructor:***@localhost/
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [201]:
%%sql
select * from instructor;

 * mysql+pymysql://instructor:***@localhost/
12 rows affected.

[('10101', 'Srinivasan', 'Comp. Sci.', Decimal('65000.00')),
 ('12121', 'Wu', 'Finance', Decimal('90000.00')),
 ('15151', 'Mozart', 'Music', Decimal('40000.00')),
 ('22222', 'Einstein', 'Physics', Decimal('95000.00')),
 ('32343', 'El Said', 'History', Decimal('60000.00')),
 ('33456', 'Gold', 'Physics', Decimal('87000.00')),
 ('45565', 'Katz', 'Comp. Sci.', Decimal('75000.00')),
 ('58583', 'Califieri', 'History', Decimal('62000.00')),
 ('76543', 'Singh', 'Finance', Decimal('80000.00')),
 ('76766', 'Crick', 'Biology', Decimal('72000.00')),
 ('83821', 'Brandt', 'Comp. Sci.', Decimal('92000.00')),
 ('98345', 'Kim', 'Elec. Eng.', Decimal('80000.00'))]

In [203]:
%%sql
select *
from department;

 * mysql+pymysql://instructor:***@localhost/
7 rows affected.

[('Biology', 'Watson', Decimal('90000.00')),
 ('Comp. Sci.', 'Taylor', Decimal('100000.00')),
 ('Elec. Eng.', 'Taylor', Decimal('85000.00')),
 ('Finance', 'Painter', Decimal('120000.00')),
 ('History', 'Painter', Decimal('50000.00')),
 ('Music', 'Packard', Decimal('80000.00')),
 ('Physics', 'Watson', Decimal('70000.00'))]

# Deletion

To delete use the `delete` command, in this format:

`delete from <table> where <predicate>`

Delete all instructors:

`delete from instructor`

Delete all instructors from the Finance department:

`delete from instructor
where dept_name= 'Finance';`

Delete all tuples in the instructor relation for those instructors associated with a department located in the Watson building:

`delete from instructor
where dept name in 
    (
        select dept name
        from department
        where building = 'Watson'
    );`

## Examples

### Example 1 - Remove all tuples from a relation

In [204]:
%%sql 
select * from student;

 * mysql+pymysql://instructor:***@localhost/
1 rows affected.

[('3003', 'Green', 'Finance', None)]

In [205]:
%%sql 
delete from student;
select * from student;

 * mysql+pymysql://instructor:***@localhost/
1 rows affected.
0 rows affected.

[]

### Example 2 - Delete tuples from a relation specified with a `where` clause

In [206]:
%%sql
select * from instructor;

 * mysql+pymysql://instructor:***@localhost/
12 rows affected.

[('10101', 'Srinivasan', 'Comp. Sci.', Decimal('65000.00')),
 ('12121', 'Wu', 'Finance', Decimal('90000.00')),
 ('15151', 'Mozart', 'Music', Decimal('40000.00')),
 ('22222', 'Einstein', 'Physics', Decimal('95000.00')),
 ('32343', 'El Said', 'History', Decimal('60000.00')),
 ('33456', 'Gold', 'Physics', Decimal('87000.00')),
 ('45565', 'Katz', 'Comp. Sci.', Decimal('75000.00')),
 ('58583', 'Califieri', 'History', Decimal('62000.00')),
 ('76543', 'Singh', 'Finance', Decimal('80000.00')),
 ('76766', 'Crick', 'Biology', Decimal('72000.00')),
 ('83821', 'Brandt', 'Comp. Sci.', Decimal('92000.00')),
 ('98345', 'Kim', 'Elec. Eng.', Decimal('80000.00'))]

In [207]:
%%sql 
delete from instructor
where dept_name= 'Finance';
select * from instructor;

 * mysql+pymysql://instructor:***@localhost/
2 rows affected.
10 rows affected.

[('10101', 'Srinivasan', 'Comp. Sci.', Decimal('65000.00')),
 ('15151', 'Mozart', 'Music', Decimal('40000.00')),
 ('22222', 'Einstein', 'Physics', Decimal('95000.00')),
 ('32343', 'El Said', 'History', Decimal('60000.00')),
 ('33456', 'Gold', 'Physics', Decimal('87000.00')),
 ('45565', 'Katz', 'Comp. Sci.', Decimal('75000.00')),
 ('58583', 'Califieri', 'History', Decimal('62000.00')),
 ('76766', 'Crick', 'Biology', Decimal('72000.00')),
 ('83821', 'Brandt', 'Comp. Sci.', Decimal('92000.00')),
 ('98345', 'Kim', 'Elec. Eng.', Decimal('80000.00'))]

### Example 3 - Delete tuples from a relation using a nested query

In [208]:
%%sql
select * from department;

 * mysql+pymysql://instructor:***@localhost/
7 rows affected.

[('Biology', 'Watson', Decimal('90000.00')),
 ('Comp. Sci.', 'Taylor', Decimal('100000.00')),
 ('Elec. Eng.', 'Taylor', Decimal('85000.00')),
 ('Finance', 'Painter', Decimal('120000.00')),
 ('History', 'Painter', Decimal('50000.00')),
 ('Music', 'Packard', Decimal('80000.00')),
 ('Physics', 'Watson', Decimal('70000.00'))]

In [209]:
%%sql
select * from instructor;

 * mysql+pymysql://instructor:***@localhost/
10 rows affected.

[('10101', 'Srinivasan', 'Comp. Sci.', Decimal('65000.00')),
 ('15151', 'Mozart', 'Music', Decimal('40000.00')),
 ('22222', 'Einstein', 'Physics', Decimal('95000.00')),
 ('32343', 'El Said', 'History', Decimal('60000.00')),
 ('33456', 'Gold', 'Physics', Decimal('87000.00')),
 ('45565', 'Katz', 'Comp. Sci.', Decimal('75000.00')),
 ('58583', 'Califieri', 'History', Decimal('62000.00')),
 ('76766', 'Crick', 'Biology', Decimal('72000.00')),
 ('83821', 'Brandt', 'Comp. Sci.', Decimal('92000.00')),
 ('98345', 'Kim', 'Elec. Eng.', Decimal('80000.00'))]

The following query will delete all the instructors which are in a department that meets in the Watson building.

First let's see which departments meet in the Watson building:

In [210]:
%%sql
select * 
from department 
where building='Watson';

 * mysql+pymysql://instructor:***@localhost/
2 rows affected.

[('Biology', 'Watson', Decimal('90000.00')),
 ('Physics', 'Watson', Decimal('70000.00'))]

We can also do a join query to see which instructors will be deleted:

In [214]:
%%sql
select instructor.* 
from instructor, department
where instructor.dept_name = department.dept_name 
and department.building='Watson';

 * mysql+pymysql://instructor:***@localhost/
0 rows affected.

[]

In [212]:
%%sql 
delete from instructor
where dept_name in (
    select dept_name
    from department                                                  
    where building = 'Watson'
);

 * mysql+pymysql://instructor:***@localhost/
3 rows affected.

[]

In [213]:
%%sql 
select * from instructor;

 * mysql+pymysql://instructor:***@localhost/
7 rows affected.

[('10101', 'Srinivasan', 'Comp. Sci.', Decimal('65000.00')),
 ('15151', 'Mozart', 'Music', Decimal('40000.00')),
 ('32343', 'El Said', 'History', Decimal('60000.00')),
 ('45565', 'Katz', 'Comp. Sci.', Decimal('75000.00')),
 ('58583', 'Califieri', 'History', Decimal('62000.00')),
 ('83821', 'Brandt', 'Comp. Sci.', Decimal('92000.00')),
 ('98345', 'Kim', 'Elec. Eng.', Decimal('80000.00'))]

# Drop vs. Delete

You can `drop` items from the schema:
* database
* table
* attribute

You delete tuples.

In [219]:
%%sql 
create table student
	(ID			varchar(5), 
	 name			varchar(20) not null, 
	 dept_name		varchar(20), 
	 tot_cred		numeric(3,0) check (tot_cred >= 0),
	 primary key (ID)
	);

 * mysql+pymysql://instructor:***@localhost/
0 rows affected.

[]

In [220]:
%%sql 
delete from student;

 * mysql+pymysql://instructor:***@localhost/
0 rows affected.

[]

In [221]:
%%sql 
drop table student;

 * mysql+pymysql://instructor:***@localhost/
0 rows affected.

[]

In [222]:
%%sql 
show tables;

 * mysql+pymysql://instructor:***@localhost/
4 rows affected.

[('budget',), ('course',), ('department',), ('instructor',)]